{
  "Opening Spaces: An Anthology of Contemporary African Women's Writing": {
    "author": "Yvonne Vera",
    "overview": "In this anthology the award-winning author Yvonne Vera brings together the stories of many talented writers from different parts of Africa."
  },
  "The Caine Prize for African Writing 2010: 11th Annual Collection": {
    "author": "The Caine Prize for African Writing",
    "overview": "The Caine Prize for African Writing is Africa's leading literary prize. For the past ten years it has supported and promoted contemporary African writing. Previous winners and entrants include Chimamanda Ngozi Adichie, Segun Afolabi, EC Osondu, Leila Aboulela, Brian Chikwava, Henrietta Rose-Innes, Mary Watson, and Binyavanga Wainaina. The 2010 collection will include the shortlisted stories and the stories written at the Caine Prize Writers' Workshop. It will be published in time for the announcement of the award in July 2010."
  },
  "African Folktales": {
    "author": "Roger D. Abrahams",
    "overview": ""
  },
  "Unchained Voices: An Anthology of Black Authors in the English-Speaking World of the Eighteenth Century": {
    "author": "Vincent Carretta",
    "overview": "Vincent Carretta has assembled the most comprehensive anthology ever published of writings by eighteenth-century people of African descent, capturing the surprisingly diverse experiences of blacks on both sides of the Atlantic--America, Britain, the West Indies, and Africa--between 1760 and 1798."
  },
  "Women Writing Africa: West Africa and the Sahel": {
    "author": "Esi Sutherland-Addy",
    "overview": "The acclaimed Women Writing Africa project “opens up worlds too often excluded from the history books” (<i>Booklist</i>) and is an “essential resource for scholars and general readers alike” (<i>Library Journal</i>). It reveals the cultural legacy of African women in their own words, in never-before- published texts that include communal songs and lullabies, letters and speeches, poetry and fiction. Representing 20 languages and 12 countries, volume 2 covers western Africa, where most African Americans find their roots. The collection presents an epic history of the region through the eyes of its women, from the age of African kings through colonialism and independence. Volume 1 of the series, <i>Women Writing Africa: The Southern Region</i>, is also available; volumes 3 and 4 will be published in 2006."
  },
  "10 Years of the Caine Prize for African Writing: Plus Coetzee, Gordimer, Achebe, Okri": {
    "author": "The Caine The Caine Prize for African Writing",
    "overview": ""
  },
  "Introduction to African Oral Literature and Performance": {
    "author": "Bayo Ogunjimi",
    "overview": "This new book puts together in a single cover, two earlier volumes by the authors, now revised to meet the challenges of a twenty-first century scholarship in African performance and cultural studies. Topics covered range from sources of African oral traditions, relevance of cosmology to African oral performance, fieldwork practice and research methodology, archetypes, folktales, myths and legends, performance and stylistic features, to various areas of poetic performances like praise poetry, religious poetry, topical, occupational and heroic poetry, their performances and more. The central theme of the book is performance, and students, scholars and readers are provided with projects and exercises intended to keep them involved in research and performance experience of the oral forms. Teaching and curriculum development suggestions are given to teachers of African oral performances. Important information is provided to guide researchers into a continued exciting experience in the study of and research into African oral traditions. Materials are included from a good number of languages and cultures of Africa including Yoruba, Hausa, Nupe, among others, so that students would be able to explore these important examples as testimony of the richness of the scholarly and cultural resources in African oral traditions."
  },
  "Violence in Francophone African and Caribbean Women's Literature": {
    "author": "Marie-Chantal Kalisa",
    "overview": "African and Caribbean peoples share a history dominated by the violent disruptions of slavery and colonialism. While much has been said about these “geographies of pain,” violence in the private sphere, particularly gendered violence, receives little attention. This book fills that void. It is a critical addition to the study of African and Caribbean women’s literatures at a time when women from these regions are actively engaged in articulating the ways in which colonial and postcolonial violence impact women.&nbsp;Chantal Kalisa examines the ways in which women writers lift taboos imposed on them by their society and culture and challenge readers with their unique perspectives on violence. Comparing women from different places and times, Kalisa treats types of violence such as colonial, familial, linguistic, and war-related, specifically linked to dictatorship and genocide. She examines Caribbean writers Michele Lacrosil, Simone Schwartz-Bart, Gisèle Pineau, and Edwidge Danticat, and Africans Ken Begul, Calixthe Beyala, Nadine Bar, and Monique Ilboudo. She also includes Sembène Ousmane and Frantz Fanon for their unique contributions to the questions of violence and gender. This study advances our understanding of the attempts of African and Caribbean women writers to resolve the tension between external forms of violence and internal forms resulting from skewed cultural, social, and political rules based on gender."
  },
  "Oral Epics from Africa": {
    "author": "John William Johnson",
    "overview": ""
  },
  "African Fundamentalism: A Literary and Cultural Anthology of Garvey's Harlem Renaissance": {
    "author": "Tony Martin",
    "overview": ""
  }
}
